app/models/shortened_url.rb

SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."shortened_url" = $1 LIMIT $2  [["shortened_url", "DjHelB8YT6JUS8y61phmBA"], ["LIMIT", 1]]
---
	def self.random_code
		code = SecureRandom.urlsafe_base64
		code = SecureRandom.urlsafe_base64 while ShortenedUrl.exists?(shortened_url: code)

INSERT INTO "shortened_urls" ("long_url", "shortened_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "test_shortened_url_1"], ["shortened_url", "DjHelB8YT6JUS8y61phmBA"], ["user_id", 1], ["created_at", "2019-07-26 09:02:39.054203"], ["updated_at", "2019-07-26 09:02:39.054203"]]
---
	def self.create_from_user_and_long_url(user, long_url)

SELECT COUNT(*) FROM "shortened_urls" WHERE "shortened_urls"."user_id" = $1 AND (created_at > '2019-07-26 07:45:47.221548')  [["user_id", 1]]
---
	def num_uniques
		visits.select('user_id').distinct.count