app/models/shortened_url.rb

SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "Kio9X548mrJq5PU1gfpUEQ"], ["LIMIT", 1]]
---
	def self.random_code
		code = SecureRandom.urlsafe_base64
		code = SecureRandom.urlsafe_base64 while ShortenedUrl.exists?(short_url: code)

INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["long_url", "test_email"], ["short_url", "Kio9X548mrJq5PU1gfpUEQ"], ["user_id", 5]]
---
	def self.create_from_user(user)
		short_url = ShortenedUrl.random_code
		ops_hash  = { long_url: user.email, short_url: short_url, user_id: user.id }
		ShortenedUrl.create!(ops_hash)