app/models/visit.rb

INSERT INTO "visits" ("user_id", "shortened_url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["shortened_url_id", 1], ["created_at", "2019-07-26 09:02:39.163496"], ["updated_at", "2019-07-26 09:02:39.163496"]]
---
	def self.record_visit!(user, shortened_url)
		ops_hash = { user_id: user.id, shortened_url_id: shortened_url.id }
		Visit.create!(ops_hash)